package ArrayList;

public class MainArrayList {
    public static void main(String[] args) {
        System.out.println("---------- Задание 1 ----------");
        System.out.println("Компаратор Comparator сравнивать- это интерфейс с методом compare(Object obj1, Object obj2) для сравнения двух переданных" +
                "объектов, а интерфейс Comparable сравнимый для сравнения использует метод compareTo(Object obj) принимает один объект сравнивает его" +
                "с другим по типу метода equals, когда нужно сравнить один с другим");
        System.out.println("---------- Задание 2 ----------");
        System.out.println("Итератор - это интерфейса Итератор с методом итератор, представляет собой пошаговый способ просмотра, позволяет посмотреть/пройти/переместиться по элементам коллекции" +
                "выполнить с ними разные действия, добавить в коллекцию объект, удалить объект, заменить на другой, удалить все объекты");
        System.out.println("---------- Задание 3 ----------");
        System.out.println("не понял это задания, но изучаю материал, интересно");
    }
}
